# item=1
# name="Slava"
# print(type(item))
#
# result=(name)
#
# print(result)
#
# items=[item, name, 'Alex', 33, [11, 22, 'Hello'], {'age':33}, True, False, {0,1,3}, 4.5]
#
# print(items)
#
# dict_items={'age':33,
#             'name':'Vadim',
#             'location': {'country':'Turkey',
#                         'City':'Antalia'}}
# print(type(dict_items), dict_items['location']['City'])

# Python. HW_1.

# 1) Создать переменную типа String
S1='string'

# 2) Создать переменную типа Integer
I=1

# 3) Создать переменную типа Float
F=1.5

# 4) Создать переменную типа Bytes
B=bytes('Pytho', 'UTF-8')

# 5) Создать переменную типа List
L=[1, 'string', 1.5]

# 6) Создать переменную типа Tuple
T=(7, 'teen', 234.3)

# 7) Создать переменную типа Set
SE={7, 'teen', 234.3}

# 8. Создать переменную типа Frozen set
FRSE=frozenset('qwerty')

# 9) Создать переменную типа Dict
D={'name':'Slava', 'age':22}

# 10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.
print("Переменная S1:", S1, "Тип данных:", type(S1))
print("Переменная I:", I, "Тип данных:", type(I))
print("Переменная F:", F, "Тип данных:", type(F))
print("Переменная B:", B, "Тип данных:", type(B))
print("Переменная L:", L, "Тип данных:", type(L))
print("Переменная T:", T, "Тип данных:", type(T))
print("Переменная SE:", SE, "Тип данных:", type(SE))
print("Переменная FRSE:", FRSE, "Тип данных:", type(FRSE))
print("Переменная D:", D, "Тип данных:", type(D))

# 11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
S1='Slava'
S2='Yurchenko'

# 12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
print(S1, I)

# 13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)

